cnlohr/lolra/ch32v/ch32v203-goertzel/adcgoertzel.c
			adc_tail+=4;
			goertzel_samples+=4;
			if( adc_tail == adc_buffer_top ) adc_tail = adc_buffer;
			if( goertzel_samples == g_goertzel_buffer )
			{
#ifdef PROFILING_PIN
	funDigitalWrite( PROFILING_PIN, 0 );
#endif

				g_goertzelp_store = goertzel;
				g_goertzelp2_store = goertzelp;

				int32_t zp = g_goertzelp_store;
				int32_t zp2 = g_goertzelp2_store;
				int32_t rr = (((int64_t)(g_goertzel_coefficient  ) * (int64_t)zp<<1)>>32) - (zp2);
				int32_t ri = (((int64_t)(g_goertzel_coefficient_s) * (int64_t)zp<<1)>>32);

				// Advanced the current goertzel advance 
				// phasor = phasor * advance;
				//  real = real * real - imag * imag;
				//  imag = real * imag + real * imag;
				// Sometimes you would bias the output here so that when truncating down you don't perpetually decay.
				// But experimentally, it didn't make a difference.
				int32_t temp = (g_goertzel_phasor_r * g_goertzel_advance_i + g_goertzel_phasor_i * g_goertzel_advance_r) >> 15;
				g_goertzel_phasor_r = (g_goertzel_phasor_r * g_goertzel_advance_r - g_goertzel_phasor_i * g_goertzel_advance_i) >> 15;
				g_goertzel_phasor_i = temp;

				// Fixup phasor over time to prevent it from dacaying.
				#define ABS(x) (((x)<0)?-(x):(x))
				int s_phasor = g_goertzel_phasor_r * g_goertzel_phasor_r + g_goertzel_phasor_i * g_goertzel_phasor_i;
				int intensity_phasor = (ABS(g_goertzel_phasor_r) + ABS(g_goertzel_phasor_i)) * 26100 / 32768 + 1; // Found experimentally (Also try to avoid divide-by-zero.
				intensity_phasor = (intensity_phasor + s_phasor/intensity_phasor)/2;
				intensity_phasor = (intensity_phasor + s_phasor/intensity_phasor)/2;
				if( intensity_phasor < 32760 )
				{
					// It is decaying, this is equivelent to f = f * 1.000244141
					g_goertzel_phasor_r += g_goertzel_phasor_r >> 12;
					g_goertzel_phasor_i += g_goertzel_phasor_i >> 12;
				}

				// Now, rotate rr, ri by that phasor.
				// To get it in line >> 15, but we also want to divide by 8 (>>3) because that makes the rest of the math easier.
				temp = (g_goertzel_phasor_r * ri + g_goertzel_phasor_i * rr) >> (15+3); 
				rr = (g_goertzel_phasor_r * rr - g_goertzel_phasor_i * ri) >> (15+3);
				ri = temp;

				// rr, ri are now in the correct frame of reference.  Continue computing.

				qibaselogs[qibaselogs_head] = ((uint16_t)rr) | (((uint16_t)ri)<<16);
				qibaselogs_head = ( qibaselogs_head + 1 ) & ((LOG_GOERTZEL_LIST)-1);

				int s = rr * rr + ri * ri;
				//int intensity = 1<<( ( 32 - __builtin_clz(s) )/2);
				#define ABS(x) (((x)<0)?-(x):(x))
				int intensity = (ABS(rr) + ABS(ri)) * 26100 / 32768; // Found experimentally (Also try to avoid divide-by-zero.
				//if( intensity == 0 )
				//	intensity = 1;
				intensity++;
				intensity = (intensity + s/intensity)/2;
				intensity = (intensity + s/intensity)/2;

				// intensity = rr * rr + ri * ri

				// This performs a low-pass IIR without exploding intensity_average.
				intensity_average = intensity_average - (intensity_average>>12) + (intensity>>6);

				#ifdef PWM_OUTPUT
				intensity = intensity * g_volume_pwm * g_pwm_period / (intensity_average>>(10-12));
				if( intensity >= g_pwm_period-1 ) intensity = g_pwm_period-2;
				if( intensity < 1 ) intensity = 1;
				TIM1->CH2CVR = intensity;  // Actual duty cycle (Off to begin with)
				#endif

				g_goertzel_outs++;
				goertzel = 0;
				goertzelp = 0;
				goertzel_samples = 0;

				// Try to improve bias.
				adc_offset -= accumulate_over_window / g_goertzel_buffer;
				accumulate_over_window = 0;

#ifdef ENABLE_OLED_SCOPE
				int rrplot = rr * 1536 / (intensity_average);
				int riplot = ri * 1536 / (intensity_average);
				rrplot += 64;
				riplot += 64;
				if( rrplot < 1 ) rrplot = 1;
				if( riplot < 1 ) riplot = 1;
				if( rrplot > 126 ) rrplot = 126;
				if( riplot > 126 ) riplot = 126;
				PlotPoint( rrplot, riplot );
#endif

#ifdef PROFILING_PIN
	funDigitalWrite( PROFILING_PIN, 1 );
#endif

			}
		}

		intfr = DMA1->INTFR;
	} while( intfr & DMA1_IT_GL1 );

	g_goertzelp2 = goertzelp2;
	g_goertzelp = goertzelp;
	g_goertzel = goertzel;
	g_goertzel_samples = goertzel_samples;
	g_accumulate_over_window = accumulate_over_window;

#ifdef PROFILING_PIN
	funDigitalWrite( PROFILING_PIN, 0 ); // For profiling
#endif
	int32_t end = SysTick->CNT;
	g_lastper = start - g_laststart;
	g_laststart = start;
	g_lastlen = end - start;
}

static inline uint32_t gets2()
{
	uint32_t ret;
	asm volatile( "mv %[ret], s2" : [ret]"=&r"(ret) );
	return ret;
}

void InnerLoop()
{
	while(1){
#if 0
		int adcz = adc_buffer[0];
		for( k = 0; k < 128; k++ )
		{
			int y = adc_buffer[k]-adcz + 64;
			if( y < 0 ) y = 0;
			if( y > 127 ) y = 127;
			ssd1306_drawPixel( k, y, 1 );
		}
#endif

		// Only display half of the list so the other half could
		// be updated by the ISR.

#ifdef ENABLE_OLED
		int pxa = 0;
		int glread = qibaselogs_head;

		for( pxa = 0; pxa < LOG_GOERTZEL_LIST; pxa++ )
		{
			uint32_t combiq = qibaselogs[glread];
			glread = ( glread + 1 ) & ( LOG_GOERTZEL_LIST -1 );

			int16_t rr = combiq & 0xffff;
			int16_t ri = combiq >> 16;

			rr = rr * 512 / (intensity_average);
			ri = ri * 512 / (intensity_average);

			rr += 64;
			ri += 64;

			if( rr < 0 ) rr = 0;
			if( ri < 0 ) ri = 0;
			if( rr > 127 ) rr = 127;
			if( ri > 127 ) ri = 127;
			
			ssd1306_drawPixel( rr, ri, 1 );
		}
		//char cts[32];
		//snprintf( cts, 32, "%d", intensity_average );
		//ssd1306_drawstr( 0, 0, cts, 1 );

		ssd1306_refresh();
		//static int ik = 0;
		//printf( "%d %08x\n", ik, ssd1306_buffer[ik++] );
		//if( ik == sizeof(ssd1306_buffer) ) ik = 0;

		ssd1306_setbuf(0);
#endif

		// Do nothing.
		Delay_Ms(17);
	}

}

uint8_t i2c_send_buffer[16];
void setup_i2c_dma(void)
{
	// Turn on DMA
	RCC->AHBPCENR |= RCC_AHBPeriph_DMA1;

	//DMA1_Channel6 is for I2C1TX
	DMA1_Channel6->PADDR = (uint32_t)&I2C1->DATAR;
	DMA1_Channel6->MADDR = (uint32_t)&i2c_send_buffer;
	DMA1_Channel6->CNTR  = 0;
	DMA1_Channel6->CFGR  =
		DMA_M2M_Disable |		 
		DMA_Priority_Low |
		DMA_MemoryDataSize_Byte |
		DMA_PeripheralDataSize_Byte |
		DMA_MemoryInc_Enable |
		DMA_Mode_Normal |
		DMA_DIR_PeripheralDST | 
		0;
	I2C1->CTLR2 = I2C_CTLR2_DMAEN | 0b111100;

